In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv('/home/mauricio/Desktop/originalUTF8.csv')

In [4]:
dataframe

  Nombre y apellido  Edad       País Automovil
0              Juan    35     Mexico        No
1             Pedro    41   Honduras        Si
2             Maria    28       Peru        Si
3             Laura    66  Argentina        No

In [22]:
País=dataframe.set_index('País')

In [8]:
País

          Nombre y apellido  Edad Automovil
País
Mexico                 Juan    35        No
Honduras              Pedro    41        Si
Peru                  Maria    28        Si
Argentina             Laura    66        No

In [28]:
País.sort_index()

          Nombre y apellido  Edad Automovil
País
Argentina             Laura    66        No
Honduras              Pedro    41        Si
Mexico                 Juan    35        No
Peru                  Maria    28        Si

In [37]:
País.loc['Peru']      #este ejemplo deberia mostrar el mismo resultado
                      #que el siguiente

Nombre y apellido    Maria
Edad                    28
Automovil               Si
Name: Peru, dtype: object

In [41]:
dataframe.loc[dataframe.País=='Argentina']

  Nombre y apellido  Edad       País Automovil
3             Laura    66  Argentina        No